<a href="https://colab.research.google.com/github/christophermalone/DSCI325/blob/main/Module3_Part2_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Module 3 | Part 2 | SQL: FILTER() Data Verb with WHERE Condition

<table width='100%' ><tr><td bgcolor='green'></td></tr></table>

### Example 3.2.SQL
For this notebook, we will consider airline data from the Bureau of Transportation.  Using the form provided on their website, one is able to obtain a variety of information around flight delays.
 

The following 17 fields will be considered here:

*   Day Information: DAY_OF_MONTH, DAY_OF_WEEK
*   Origin Information: ORIGIN, ORIGIN_STATE
*   Destination Information: DEST, DEST_STATE
*   Departure Information: DEP_TIME, DEP_DELAY, DEP_DELAY15, 
*   Arrival Information: ARR_TIME, ARR_DELAY, ARR_DEL15, 
*   Reason for Delay: CARRIER_DELAY, WEATHER_DELAY, SECURITY_DELAY, LATE_AIRCRAFT_DELAY


<br>Data Source:  https://www.transtats.bts.gov/DL_SelectFields.asp?gnoyr_VQ=FGJ&QO_fu146_anzr=b0-gvzr

<table width='100%' ><tr><td bgcolor='green'></td></tr></table>

## Making a Connection

Here, an SQLite3 package will be used to connect to the desired datqbase.

In [2]:
import pandas as pd
import sqlite3

The following code can be used to open and close a connection. It is important to close the established connection.

In [ ]:
#Making a connection using sqlite3
connect_db = sqlite3.connect("/content/sample_data/OECD_EmploymentRates.db")

# SQL CODE WILL GO HERE

#Closing the connection
connect_db.close()

# Utility Functions in SQL

First, obtain a list of tables in this database.

In [5]:
#Making a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement
df = pd.read_sql_query(
                        "SELECT name FROM sqlite_master WHERE type='table'"
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show output
df.head()

          name
0      Flights
1  MN_Airports

Next, investigate the contents of the Flights table.

In [7]:
#Makign a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement
df = pd.read_sql_query(
                        "PRAGMA table_info(Flights)"
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show output
df.head(20)

    cid                 name type  notnull dflt_value  pk
0     0         DAY_OF_MONTH             0       None   0
1     1          DAY_OF_WEEK             0       None   0
2     2               ORIGIN             0       None   0
3     3         ORIGIN_STATE             0       None   0
4     4                 DEST             0       None   0
5     5           DEST_STATE             0       None   0
6     6             DEP_TIME             0       None   0
7     7            DEP_DELAY             0       None   0
8     8            DEP_DEL15             0       None   0
9     9             ARR_TIME             0       None   0
10   10            ARR_DELAY             0       None   0
11   11            ARR_DEL15             0       None   0
12   12        CARRIER_DELAY             0       None   0
13   13        WEATHER_DELAY             0       None   0
14   14            NAS_DELAY             0       None   0
15   15       SECURITY_DELAY             0       None   0
16   16  LATE_AIRCRAFT_DELAY             0       None   0

Getting a list of the fields in the MN_Airports table.

In [8]:
#Makign a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement
df = pd.read_sql_query(
                        "PRAGMA table_info(MN_Airports)"
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show output
df.head(20)

   cid     name type  notnull dflt_value  pk
0    0  Airport             0       None   0
1    1    State             0       None   0
2    2     Type             0       None   0

SQL allows one to obtain just a few rows using the The <strong>LIMIT</strong> statement.  This statement is put at the end of sql statement. The followign will limit the number of rows returned to 10.

<strong>Note</strong>: The number of rows returned by the SQL statement is indeed 10, the df.head() is limiting the number of rows being shown to 5.

In [12]:
#Making a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement
df = pd.read_sql_query(
                          "SELECT * from Flights LIMIT 10"
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show output
df.head()

#Using pandas to show all 10 rows
df.head(10)

  DAY_OF_MONTH DAY_OF_WEEK ORIGIN  ... NAS_DELAY SECURITY_DELAY LATE_AIRCRAFT_DELAY
0            1           2    CLT  ...
1            1           2    MCO  ...
2            1           2    DFW  ...
3            1           2    MCO  ...
4            1           2    EWR  ...
5            1           2    MEM  ...
6            1           2    DFW  ...
7            1           2    DFW  ...         0              0                  15
8            1           2    RNO  ...         0              0                   0
9            1           2    CLT  ...

[10 rows x 17 columns]

There are a limited number of airports in MN; thus, the LIMIT statement is not needed for this table.

In [13]:
#Making a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement
df = pd.read_sql_query(
                          "SELECT * from MN_Airports"
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show all 10 rows
df.head(10)

  Airport State          Type
0     BJI    MN      Regional
1     BRD    MN      Regional
2     DLH    MN      Regional
3     HIB    MN      Regional
4     INL    MN      Regional
5     MSP    MN  Not Regional
6     RST    MN      Regional
7     STC    MN      Regional

# Simple WHERE Statements

To begin, suppose the goal is to obtain only flights whose ORIGIN airport was Rochester, MN.  The airport code for Rochester, MN is <strong>RST</strong>.

<p align='center'><img src="https://drive.google.com/uc?export=view&id=1cZ49YcqPChfiBZP0Hq7Ahzxn4Sg3ktG-" width='25%' height='25%'></p>

In [15]:
#Making a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement to get RST flights
RST = pd.read_sql_query(
                          "SELECT * from Flights WHERE (ORIGIN == 'RST') "
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show all 10 rows
RST.head(10)

#Getting number of rows and columns
RST.shape

(238, 17)

Consider the use of the <strong>COUNT()</strong> summary function in SQL.  The following code does *not* return the actual rows, but instead a count of the number of flights that where ORIGIN == RST.

In [19]:
#Making a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement to get count for RST
RST_Count = pd.read_sql_query(
                          "SELECT COUNT(*) AS RST_Count from Flights WHERE (ORIGIN == 'RST') "
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show all 10 rows
RST_Count.head(10)

#Using pandas to show dimension of dataframe
#RST_Count.head(10)

   RST_Count
0        238

Next, let us collect the rows where the ORIGIN airport is RST and the destination airport is MSP, i.e. Minneapolis, MN.

<p align='center'><img src="https://drive.google.com/uc?export=view&id=1c142gdrEPwS_j09pqK1x8kpQjYDYSs47" width='25%' height='25%'></p>

In [21]:
#Making a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement to get RST flights into MSP
RST_to_MSP = pd.read_sql_query(
                          "SELECT * from Flights WHERE ( (ORIGIN == 'RST') AND (DEST == 'MSP') ) "
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show all 10 rows
RST_to_MSP.head(10)

#Getting number of rows and columns
#RST_to_MSP.shape

  DAY_OF_MONTH DAY_OF_WEEK ORIGIN  ... NAS_DELAY SECURITY_DELAY LATE_AIRCRAFT_DELAY
0            1           2    RST  ...
1            1           2    RST  ...
2            1           2    RST  ...
3            1           2    RST  ...
4            2           3    RST  ...
5            2           3    RST  ...
6            2           3    RST  ...
7            2           3    RST  ...
8            3           4    RST  ...
9            3           4    RST  ...

[10 rows x 17 columns]

Next, let us collect the rows where the ORIGIN airport is RST or the ORIGIN airport is DLH, i.e. Duluth, MN, whose destintation in MSP.

<p align='center'><img src="https://drive.google.com/uc?export=view&id=1zQzTj9PJkooEfkkaioffNW1O49Cocy7Y" width='25%' height='25%'></p>

In [29]:
#Making a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement to get RST or DLH flights into MSP
RST_or_DLH_to_MSP = pd.read_sql_query(
                          "SELECT * from Flights WHERE ( (ORIGIN == 'RST' AND DEST='MSP') OR (ORIGIN == 'DLH' AND DEST == 'MSP') )  "
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show all 10 rows
#RST_or_DLH_to_MSP.head(10)

#Getting number of rows and columns
RST_or_DLH_to_MSP.shape

(239, 17)

Next, let us collect the rows where the ORIGIN airport is in MN and purposely exclude MSP.  This will be done here with a sequence of <strong>OR</strong> statements.

<p align='center'><img src="https://drive.google.com/uc?export=view&id=1hMSS_XOgk5izrSa1PNvKSiWkM62c9xMn" width='25%' height='25%'></p>

In [30]:
#Making a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement to get RST or DLH flights into MSP
All_MN_to_MSP = pd.read_sql_query(
                          "SELECT * from Flights WHERE ( (ORIGIN == 'BJI') OR (ORIGIN == 'BRD') OR (ORIGIN == 'DLH') OR (ORIGIN == 'HIB') OR (ORIGIN == 'INL') OR (ORIGIN == 'RST') OR (ORIGIN == 'STC') )  "
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show all 10 rows
#All_MN_to_MSP.head(10)

#Getting number of rows and columns
All_MN_to_MSP.shape

(593, 17)

Consider the following use of the <strong>IN</strong> statement.  In our database, a secondary table contains information regarding the regional airports in MN.  MSP is included is this secondary table; thus, Type == 'Regional' will be used to exclude MSP from consideration in the IN statement.

In [32]:
#Making a connection
connect_db = sqlite3.connect("/content/sample_data/OnTime.db")

#SQL Statement to get RST or DLH flights into MSP
All_MN_to_MSP = pd.read_sql_query(
                          "SELECT * from Flights WHERE ( ORIGIN IN (SELECT Airport from MN_Airports WHERE Type == 'Regional') )  "
                          , connect_db)
#Closing the connection
connect_db.close()

#Using pandas to show all 10 rows
#All_MN_to_MSP.head(10)

#Getting number of rows and columns
All_MN_to_MSP.shape

(593, 17)